[
  {
    "text": "The M4 MacBook Air is probably by now the world's most popular laptop. And now that I've had it for",
    "start": 0.08,
    "duration": 6.08
  },
  {
    "text": "6 months, I'll take you through whether or not I think this MacBook Air is worth owning, especially",
    "start": 6.16,
    "duration": 5.04
  },
  {
    "text": "compared to the more expensive MacBook Pro and who I think this laptop is for. Performance is",
    "start": 11.2,
    "duration": 5.76
  },
  {
    "text": "the first highlight with this laptop. This MacBook Air has Apple's latest M4 chip. And like the first",
    "start": 16.96,
    "duration": 5.84
  },
  {
    "text": "MacBook Air with Apple Silicon, you don't have to compromise on performance to get good battery",
    "start": 22.8,
    "duration": 4.88
  },
  {
    "text": "life and vice versa. This MacBook Air continues that tradition. The 15-inch version I bought is",
    "start": 27.68,
    "duration": 6.24
  },
  {
    "text": "rated for up to 18 hours of battery life for video streaming and 15 hours for wireless web",
    "start": 33.92,
    "duration": 6.96
  },
  {
    "text": "surfing. Its battery life easily lasts me through an entire workday when working from it. And often",
    "start": 40.88,
    "duration": 6.32
  },
  {
    "text": "I can squeeze in two consecutive work days without needing to charge it. The performance for this",
    "start": 47.2,
    "duration": 4.88
  },
  {
    "text": "laptop, I think, is good enough for most general computing workloads. Whether you're a college",
    "start": 52.08,
    "duration": 5.92
  },
  {
    "text": "student writing papers, a professional on Zoom calls, or even doing some light photo editing,",
    "start": 58.0,
    "duration": 4.72
  },
  {
    "text": "this chip can handle all of those workloads. Not only can it handle those workloads,",
    "start": 62.72,
    "duration": 4.88
  },
  {
    "text": "but it's also been able to handle having multiple tabs open, music apps, messages, AI programs,",
    "start": 67.6,
    "duration": 6.16
  },
  {
    "text": "basically everything I've been able to throw at it during my normal use. And I haven't experienced",
    "start": 73.76,
    "duration": 5.44
  },
  {
    "text": "any glitches or slowdowns. And I bought the bare minimum 16 gigs of RAM version of this laptop.",
    "start": 79.2,
    "duration": 6.88
  },
  {
    "text": "It's only for things like graphics intensive tasks like some serious Photoshop work and especially",
    "start": 86.08,
    "duration": 5.28
  },
  {
    "text": "for things like video editing, motion graphics. That's where I've stuck to Apple's Pro line of",
    "start": 91.36,
    "duration": 5.44
  },
  {
    "text": "computers like my M1 Ultra Mac Studio, which I've reviewed for all of my video editing workloads.",
    "start": 96.8,
    "duration": 6.64
  },
  {
    "text": "And speaking of apps, if you've ever had an idea for an app but thought you needed to learn how to",
    "start": 103.44,
    "duration": 4.64
  },
  {
    "text": "code first, let me introduce you to something that completely changes the game, Emergent AI,",
    "start": 108.08,
    "duration": 6.24
  },
  {
    "text": "who sponsored this video. I've been testing this AI platform that lets you build production-ready",
    "start": 114.32,
    "duration": 5.52
  },
  {
    "text": "apps just by having a conversation with AI. Not prototypes, actual apps with backends, databases,",
    "start": 119.84,
    "duration": 6.8
  },
  {
    "text": "authentication, and everything you need to launch. What makes Emergent different from other AI coding",
    "start": 126.64,
    "duration": 5.52
  },
  {
    "text": "platforms is that it doesn't just generate code snippets or basic UIs. It's what they call agentic",
    "start": 132.16,
    "duration": 6.56
  },
  {
    "text": "vibe coding. Multiple AI agents working together to handle your entire software stack. But here's",
    "start": 138.72,
    "duration": 6.72
  },
  {
    "text": "what really impressed me. If you run into a bug, Emergent's testing agent can automatically catch",
    "start": 145.44,
    "duration": 5.76
  },
  {
    "text": "it and fix it without you having to debug anything yourself. It's like having an",
    "start": 151.2,
    "duration": 5.76
  },
  {
    "text": "entire development team working 24/7. You can build web apps, mobile apps with React Native,",
    "start": 156.96,
    "duration": 5.92
  },
  {
    "text": "and even complex AI applications. Everything deploys with one click, and you own all your",
    "start": 162.88,
    "duration": 6.08
  },
  {
    "text": "code and data. Over 1 million people are already building with Emergent, and they just hit $10",
    "start": 168.96,
    "duration": 5.68
  },
  {
    "text": "million in revenue in just 3 months, proving this isn't just hype, it's the real deal. Whether",
    "start": 174.64,
    "duration": 6.0
  },
  {
    "text": "you're a complete beginner with just an idea or an experienced developer who wants to build faster,",
    "start": 180.64,
    "duration": 5.76
  },
  {
    "text": "Emergent turns conversations into applications. Use the link in the description to try it for",
    "start": 186.4,
    "duration": 5.44
  },
  {
    "text": "yourself. And thanks to Emergent for sponsoring this video. The next highlight is the keyboard",
    "start": 191.84,
    "duration": 5.04
  },
  {
    "text": "and form factor. The MacBook Air has my favorite typing experience of any laptop. The key travel",
    "start": 196.88,
    "duration": 6.24
  },
  {
    "text": "is minimal. I find I can type on it pretty fast with little effort. The trackpad is still hands",
    "start": 203.12,
    "duration": 5.92
  },
  {
    "text": "down the best trackpad out of any laptop thanks to the larger size and haptic feedback, which I",
    "start": 209.04,
    "duration": 6.56
  },
  {
    "text": "find less taxing to use than other trackpads where you have to physically like move the whole thing",
    "start": 215.6,
    "duration": 4.88
  },
  {
    "text": "down over and over again, which can feel taxing, especially if you're clicking towards the top of",
    "start": 220.48,
    "duration": 5.84
  },
  {
    "text": "the trackpad where you usually feel a bit more resistance. The trackpad size is also great for",
    "start": 226.32,
    "duration": 6.16
  },
  {
    "text": "all of macOS's multi-touch gestures, many of which are now also shared with iPadOS as well,",
    "start": 232.48,
    "duration": 6.56
  },
  {
    "text": "making it easy to switch back and forth between the devices. Display quality is another major",
    "start": 239.04,
    "duration": 5.84
  },
  {
    "text": "highlight. The color accuracy is excellent, and True Tone continues to be an underrated feature of",
    "start": 244.88,
    "duration": 5.76
  },
  {
    "text": "Apple devices. This feature automatically adjusts the white balance of the display based on the",
    "start": 250.64,
    "duration": 5.44
  },
  {
    "text": "ambient lighting conditions around you, making the display more comfortable to look at. And because",
    "start": 256.08,
    "duration": 5.36
  },
  {
    "text": "the display is an LCD backlit display, while it won't have the crazy good contrast you get with",
    "start": 261.44,
    "duration": 6.56
  },
  {
    "text": "OLED displays, it generally doesn't suffer from the same PWM flickering issues that affect some",
    "start": 268.0,
    "duration": 6.64
  },
  {
    "text": "people with OLED displays, which rapidly turns the screen on and off to appear brighter or dimmer,",
    "start": 274.64,
    "duration": 6.56
  },
  {
    "text": "which can cause some headaches, eye strain, and other health issues for certain people.",
    "start": 281.2,
    "duration": 5.6
  },
  {
    "text": "The MacBook Air doesn't have that potential downside. Now, one weird thing the MacBook Air has",
    "start": 286.8,
    "duration": 5.6
  },
  {
    "text": "is the notch, which unlike the iPhone's Dynamic Island, which houses not just the selfie camera,",
    "start": 292.4,
    "duration": 5.84
  },
  {
    "text": "but also Touch ID components, the notch on the MacBook Air just houses the selfie camera. I",
    "start": 298.24,
    "duration": 5.68
  },
  {
    "text": "really hope at some point they'll be able to shrink down the Face ID components to the point",
    "start": 303.92,
    "duration": 4.16
  },
  {
    "text": "where they can be embedded in MacBooks as well as the Studio Display for that matter. After using",
    "start": 308.08,
    "duration": 6.08
  },
  {
    "text": "Surface devices like the Surface Laptop I reviewed and the Surface Pro I'm currently reviewing,",
    "start": 314.16,
    "duration": 5.6
  },
  {
    "text": "which both feature Windows Hello, I definitely prefer unlocking with my face. It's just a more",
    "start": 319.76,
    "duration": 6.4
  },
  {
    "text": "frictionless process. The MacBook Air's display is rated for 500 nits of brightness, which is fine",
    "start": 326.16,
    "duration": 6.4
  },
  {
    "text": "for indoor use, but if you want to use it outdoors a lot, you might want the brighter display that",
    "start": 332.56,
    "duration": 5.04
  },
  {
    "text": "you'll get with a MacBook Pro, which can go all the way up to 1,600 nits of peak brightness in",
    "start": 337.6,
    "duration": 5.6
  },
  {
    "text": "HDR and up to 1,000 nits in SDR, which is still double the brightness of the MacBook Air. The",
    "start": 343.2,
    "duration": 6.56
  },
  {
    "text": "MacBook Pros can also be optioned with Apple's nano-texture display, which helps reduce glare,",
    "start": 349.76,
    "duration": 6.08
  },
  {
    "text": "and you cannot option the MacBook Air with a nano-texture display. Next up is the MagSafe port,",
    "start": 355.84,
    "duration": 6.16
  },
  {
    "text": "another highlight. Why not just charge it via USB-C? Like, why have this proprietary plug?",
    "start": 362.0,
    "duration": 5.68
  },
  {
    "text": "MagSafe has two main advantages. The first is its status light, which tells you when your laptop is",
    "start": 367.68,
    "duration": 6.56
  },
  {
    "text": "charging versus when it's completely charged. And the second is your computer won't go flying across",
    "start": 374.24,
    "duration": 6.24
  },
  {
    "text": "your room if someone trips over your charging cord thanks to its magnetic quick release. Another",
    "start": 380.48,
    "duration": 5.44
  },
  {
    "text": "highlight with this MacBook Air was actually the transfer process, which I thought was overall",
    "start": 385.92,
    "duration": 5.12
  },
  {
    "text": "quite smooth. However, while doing it wirelessly is certainly convenient, it isn't fast wirelessly.",
    "start": 391.04,
    "duration": 7.36
  },
  {
    "text": "It said it would take me about 2 hours. So, I plugged my M3 MacBook Air into the M4 MacBook",
    "start": 398.4,
    "duration": 6.4
  },
  {
    "text": "Air using a Thunderbolt 4 cable that shipped with my Studio Display, and the transfer took",
    "start": 404.8,
    "duration": 5.92
  },
  {
    "text": "approximately 20 minutes to complete, transferring over 400 gigs of data. More MacBooks should either",
    "start": 410.72,
    "duration": 5.92
  },
  {
    "text": "come with this cable or give you a discount on adding one to your cart when you purchase a new",
    "start": 416.64,
    "duration": 4.88
  },
  {
    "text": "MacBook for these way faster transfers. Now, the last and one of the most important features to",
    "start": 421.52,
    "duration": 6.32
  },
  {
    "text": "talk about with the MacBook Air is actually how well it integrates in with other Apple products.",
    "start": 427.84,
    "duration": 6.56
  },
  {
    "text": "Some notable Apple ecosystem features I found useful have been its Passwords app, which now",
    "start": 434.4,
    "duration": 5.76
  },
  {
    "text": "gives you an easy place on the Mac to find all of your saved passwords that you've saved across",
    "start": 440.16,
    "duration": 5.12
  },
  {
    "text": "your Apple devices. I use AirDrop all of the time to move files from one Apple device to my Mac. I",
    "start": 445.28,
    "duration": 6.8
  },
  {
    "text": "love being able to see all of my messages from my iPhone on my MacBook Air. You can even mirror your",
    "start": 452.08,
    "duration": 6.0
  },
  {
    "text": "entire iPhone on Mac via screen mirroring, which I've actually found works really well and has been",
    "start": 458.08,
    "duration": 5.68
  },
  {
    "text": "really useful, especially for authentication apps. Having my Focus mode sync across all of my Apple",
    "start": 463.76,
    "duration": 5.92
  },
  {
    "text": "devices has also been really useful. So, I don't get most notifications during work hours when",
    "start": 469.68,
    "duration": 5.84
  },
  {
    "text": "I'm trying to concentrate on writing or filming. Because I have an iPad, occasionally I'll open up",
    "start": 475.52,
    "duration": 6.08
  },
  {
    "text": "a contract or something I need to sign on my Mac and via Preview just send it over to my iPad for a",
    "start": 481.6,
    "duration": 6.32
  },
  {
    "text": "quick professional-looking signature. Also, I love the little icon that'll appear in my MacBook Air's",
    "start": 487.92,
    "duration": 5.84
  },
  {
    "text": "dock if I have a Safari tab open on another one of my Apple devices or another app open and with",
    "start": 493.76,
    "duration": 6.0
  },
  {
    "text": "just one click, I can open up right where I left off on the other device on the MacBook Air. Now,",
    "start": 499.76,
    "duration": 5.76
  },
  {
    "text": "this is by no means an exhaustive list of all of the Apple ecosystem features you can use with your",
    "start": 505.52,
    "duration": 5.68
  },
  {
    "text": "MacBook if you have other Apple devices. I didn't even go through automatic switching with AirPods",
    "start": 511.2,
    "duration": 5.2
  },
  {
    "text": "or dragging things across two different Macs. So, what features have I not found myself using with",
    "start": 516.4,
    "duration": 5.36
  },
  {
    "text": "the MacBook Air? First up is Apple Intelligence on Mac. I just haven't found much use for it.",
    "start": 521.76,
    "duration": 6.16
  },
  {
    "text": "And 6 months later, honestly, other than the new Siri animation, I completely forgot it was part of",
    "start": 527.92,
    "duration": 5.52
  },
  {
    "text": "the Mac. I also haven't used the speakers that much, though they actually sound pretty decent",
    "start": 533.44,
    "duration": 4.72
  },
  {
    "text": "on the 15-inch compared to the 13-inch, which I talk about in more detail in my comparison video",
    "start": 538.16,
    "duration": 5.92
  },
  {
    "text": "between those two sizes of the MacBook Air, which you can get to by clicking here. Now, let's talk",
    "start": 544.08,
    "duration": 5.68
  },
  {
    "text": "about the downsides I've encountered while using the MacBook Air. The first is the 60 Hz refresh",
    "start": 549.76,
    "duration": 5.92
  },
  {
    "text": "rate. I do notice it when scrolling, mostly because as of this recording, it's one of the only",
    "start": 555.68,
    "duration": 5.12
  },
  {
    "text": "Apple devices I have that still uses a max of 60 Hz refresh rate. And at this current price point,",
    "start": 560.8,
    "duration": 8.08
  },
  {
    "text": "I think it's getting to be pretty inexcusable for the MacBook Airs not to have Apple's ProMotion",
    "start": 568.88,
    "duration": 5.6
  },
  {
    "text": "tech, which increases the refresh rate up to a max of 120 hertz, especially now that Apple has added",
    "start": 574.48,
    "duration": 7.04
  },
  {
    "text": "ProMotion to all of 2025's iPhones except for the 16e. The webcam is still fine, not amazing",
    "start": 581.52,
    "duration": 8.48
  },
  {
    "text": "quality. It's a 12 megapixel camera with Center Stage that can autoframe you, but you can use your",
    "start": 590.0,
    "duration": 5.84
  },
  {
    "text": "iPhone as the webcam if you want better quality as well as that Center Stage autoframe capability,",
    "start": 595.84,
    "duration": 6.24
  },
  {
    "text": "plus the ability to have a top-down view with some iPhone models. Another downside is there's",
    "start": 602.08,
    "duration": 5.2
  },
  {
    "text": "no cellular option built in. And now that more and more phone plans are allowing you to add",
    "start": 607.28,
    "duration": 5.84
  },
  {
    "text": "a computer or an iPad onto your plan free of charge, like my Google Fi plans here in the US,",
    "start": 613.12,
    "duration": 6.72
  },
  {
    "text": "I actually think now would be the perfect time to have a MacBook Air with 5G and eSIM,",
    "start": 619.84,
    "duration": 6.4
  },
  {
    "text": "so you can skip the hotspot step and just connect directly to the 5G network when you need it. Now,",
    "start": 626.24,
    "duration": 6.0
  },
  {
    "text": "the last downside with the MacBook Air is ports. You only get two USB-C ports. That's only one less",
    "start": 632.24,
    "duration": 7.04
  },
  {
    "text": "than a MacBook Pro. But if this is going to be your main computer, depending on your workflows,",
    "start": 639.28,
    "duration": 5.12
  },
  {
    "text": "two might not be enough. So overall, do I recommend getting an M4 MacBook Air? Yes. I",
    "start": 644.4,
    "duration": 7.44
  },
  {
    "text": "think in general if you're looking for a laptop that's really nicely designed, integrates well",
    "start": 651.84,
    "duration": 5.2
  },
  {
    "text": "with the Apple ecosystem, has great battery life, an excellent keyboard, trackpad, and it looks",
    "start": 657.04,
    "duration": 6.8
  },
  {
    "text": "stunning, and you don't need the extra performance or ports that you get with the MacBook Pro, this",
    "start": 663.84,
    "duration": 6.16
  },
  {
    "text": "would be a great laptop for you. Now, if you've decided, okay, the MacBook Air is for me, there",
    "start": 670.0,
    "duration": 6.16
  },
  {
    "text": "are some other questions you might have, like how much storage and RAM you should configure with",
    "start": 676.16,
    "duration": 4.8
  },
  {
    "text": "it. In general, if this is going to be your main computer and you plan to keep all of the photos",
    "start": 680.96,
    "duration": 5.44
  },
  {
    "text": "and videos that you take from your phone backed up on here, which you probably should, I'd recommend",
    "start": 686.4,
    "duration": 6.0
  },
  {
    "text": "at least 512 gigs of storage. 256 GB probably won't be enough if you plan on keeping this laptop",
    "start": 692.4,
    "duration": 7.2
  },
  {
    "text": "for several years and backing up photos and videos to it. Now, if you plan to do a lot of work in",
    "start": 699.6,
    "duration": 4.96
  },
  {
    "text": "Photoshop or even any light video editing on this computer, which it can technically do, though,",
    "start": 704.56,
    "duration": 5.52
  },
  {
    "text": "I personally would opt for a MacBook Pro for the video editing stuff. All of that can add to your",
    "start": 710.08,
    "duration": 5.6
  },
  {
    "text": "storage in a hurry. For those workloads, that's where I'd opt for 1 TB. Now, what about RAM? Well,",
    "start": 715.68,
    "duration": 6.88
  },
  {
    "text": "RAM has become a bit trickier with Apple Silicon Macs because these ARM-based chips are a bit more",
    "start": 722.56,
    "duration": 5.68
  },
  {
    "text": "efficient with their RAM use. So, you typically get away with using less RAM than you would have",
    "start": 728.24,
    "duration": 4.96
  },
  {
    "text": "a few years ago. That being said though, if you want to keep this laptop for 5 to 7 years,",
    "start": 733.2,
    "duration": 6.88
  },
  {
    "text": "I would upgrade the RAM from 16 to at least 24 gigs. It might be a bit overkill,",
    "start": 740.08,
    "duration": 6.48
  },
  {
    "text": "but it should give you more headroom for future OS upgrades or programs you use that might hog",
    "start": 746.56,
    "duration": 5.44
  },
  {
    "text": "the RAM a bit more. Another question you might not have thought to ask yourself, but it's actually",
    "start": 752.0,
    "duration": 4.64
  },
  {
    "text": "really important is what power adapter to go with. By default, Apple configures the 8-core GPU model",
    "start": 756.64,
    "duration": 6.48
  },
  {
    "text": "with a 30-watt adapter, while the 10-core GPU model includes the 35-watt dual USB-C adapter. But",
    "start": 763.12,
    "duration": 8.0
  },
  {
    "text": "if you want to actually run any intensive program on your MacBook Air or just charge it up faster,",
    "start": 771.12,
    "duration": 5.84
  },
  {
    "text": "you should absolutely go with the 70W power adapter instead. And I've left purchase links",
    "start": 776.96,
    "duration": 5.6
  },
  {
    "text": "to the base MacBook Airs and accessories in the product links for this video where you can",
    "start": 782.56,
    "duration": 5.44
  },
  {
    "text": "compare prices at multiple retailers, including eBay, if you want to try and save some money and",
    "start": 788.0,
    "duration": 5.28
  },
  {
    "text": "go for a used MacBook Air. Link to that in the description and pinned comment. Now, the last",
    "start": 793.28,
    "duration": 5.92
  },
  {
    "text": "question you probably have is, \"Okay, should I get the 15-inch or the 13-inch version?\" Well,",
    "start": 799.2,
    "duration": 5.52
  },
  {
    "text": "I actually have an entire video dedicated to that topic, which you can get to by clicking here. So,",
    "start": 804.72,
    "duration": 6.08
  },
  {
    "text": "those are my thoughts on the M4 MacBook Air after 6 months of using one. But now it's your turn.",
    "start": 810.8,
    "duration": 6.0
  },
  {
    "text": "Let me know what you think of the MacBook Air in the comments and if you'd recommend getting one.",
    "start": 816.8,
    "duration": 5.12
  },
  {
    "text": "And for more of my 6 Months Later reviews, you can click here to get to all of those. And you",
    "start": 821.92,
    "duration": 5.04
  },
  {
    "text": "can see all of the products we recommend at any time by visiting 6months.net/shop.",
    "start": 826.96,
    "duration": 7.44
  },
  {
    "text": "For 6 Months Later, I'm Josh Teder. Thanks for watching.",
    "start": 834.4,
    "duration": 4.96
  }
]